In [1]:
from google.cloud import bigquery
from google.oauth2 import service_account


credentials_path = 'clave_db.json'
credentials = service_account.Credentials.from_service_account_file(credentials_path)
project_id = 'aplicaciones-analitica'

client = bigquery.Client(credentials= credentials, project=project_id) # creacion del client para trabajar en python

In [2]:
consulta = 'select * from `aplicaciones-analitica.recursos_humanos.data_train`;'

data = client.query(consulta).to_dataframe()

In [3]:
data.head()

,InfoDate,EmployeeID,Age,DistanceFromHome,MonthlyIncome,NumCompaniesWorked,PercentSalaryHike,StockOptionLevel,TrainingTimesLastYear,YearsAtCompany,...,Department,Education,Gender,JobLevel,JobRole,MaritalStatus,retirementType,resignationReason,Attrition,retirementDate
0,2015-12-31,2532,32,9,43270,8.0,13,0,4,0,...,Sales,Master,Male,4,Sales Executive,Single,None,None,0,NaT
1,2015-12-31,1062,32,9,43270,8.0,13,0,4,0,...,Sales,Master,Male,4,Sales Executive,Single,None,None,0,NaT
2,2015-12-31,4002,32,9,43270,8.0,13,0,4,0,...,Sales,Master,Male,4,Sales Executive,Single,None,None,0,NaT
3,2015-12-31,3361,48,1,21770,4.0,18,0,4,0,...,Research & Development,Master,Male,1,Research Scientist,Married,None,None,0,NaT
4,2015-12-31,421,48,1,21770,4.0,18,0,4,0,...,Research & Development,Master,Male,1,Research Scientist,Married,None,None,0,NaT

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   InfoDate                 4410 non-null   dbdate
 1   EmployeeID               4410 non-null   Int64
 2   Age                      4410 non-null   Int64
 3   DistanceFromHome         4410 non-null   Int64
 4   MonthlyIncome            4410 non-null   Int64
 5   NumCompaniesWorked       4410 non-null   float64
 6   PercentSalaryHike        4410 non-null   Int64
 7   StockOptionLevel         4410 non-null   Int64
 8   TrainingTimesLastYear    4410 non-null   Int64
 9   YearsAtCompany           4410 non-null   Int64
 10  YearsSinceLastPromotion  4410 non-null   Int64
 11  YearsWithCurrManager     4410 non-null   Int64
 12  TotalWorkingYears        4410 non-null   float64
 13  EnvironmentSatisfaction  4410 non-null   float64
 14  JobSatisfaction          4410 non-null   float64
 15  WorkLifeBalance          4410 non-null   float64
 16  BusinessTravel           4410 non-null   object
 17  Department               4410 non-null   object
 18  Education                4410 non-null   object
 19  Gender                   4410 non-null   object
 20  JobLevel                 4410 non-null   Int64
 21  JobRole                  4410 non-null   object
 22  MaritalStatus            4410 non-null   object
 23  retirementType           650 non-null    object
 24  resignationReason        585 non-null    object
 25  Attrition                4410 non-null   Int64
 26  retirementDate           650 non-null    dbdate
dtypes: Int64(12), dbdate(2), float64(5), object(8)
memory usage: 982.0+ KB